## production: common
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 3 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                          NAME                          |
|--------|--------------------------------------------------------|
| add    | `aws_sns_topic_subscription.sqs_callback_subscription` |
|        | `aws_sqs_queue.ses_receipt_callback_buffer`            |
|        | `aws_sqs_queue_policy.allow_sns_publish`               |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
14:46:35.181 STDOUT terraform:   + create
14:46:35.181 STDOUT terraform:  <= read (data resources)
14:46:35.181 STDOUT terraform: Terraform will perform the following actions:
14:46:35.181 STDOUT terraform:   # data.aws_iam_policy_document.sns_to_sqs will be read during apply
14:46:35.181 STDOUT terraform:   # (config refers to values not yet known)
14:46:35.181 STDOUT terraform:  <= data "aws_iam_policy_document" "sns_to_sqs" {
14:46:35.181 STDOUT terraform:       + id            = (known after apply)
14:46:35.181 STDOUT terraform:       + json          = (known after apply)
14:46:35.181 STDOUT terraform:       + minified_json = (known after apply)
14:46:35.181 STDOUT terraform:       + statement {
14:46:35.181 STDOUT terraform:           + actions   = [
14:46:35.181 STDOUT terraform:               + "sqs:SendMessage",
14:46:35.181 STDOUT terraform:             ]
14:46:35.181 STDOUT terraform:           + effect    = "Allow"
14:46:35.181 STDOUT terraform:           + resources = [
14:46:35.181 STDOUT terraform:               + (known after apply),
14:46:35.181 STDOUT terraform:             ]
14:46:35.181 STDOUT terraform:           + sid       = "AllowSNSPublish"
14:46:35.181 STDOUT terraform:           + condition {
14:46:35.181 STDOUT terraform:               + test     = "ArnLike"
14:46:35.181 STDOUT terraform:               + values   = [
14:46:35.181 STDOUT terraform:                   + "arn:aws:sns:ca-central-1:296255494825:ses-callback",
14:46:35.181 STDOUT terraform:                 ]
14:46:35.181 STDOUT terraform:               + variable = "aws:SourceArn"
14:46:35.181 STDOUT terraform:             }
14:46:35.181 STDOUT terraform:           + principals {
14:46:35.181 STDOUT terraform:               + identifiers = [
14:46:35.181 STDOUT terraform:                   + "*",
14:46:35.181 STDOUT terraform:                 ]
14:46:35.181 STDOUT terraform:               + type        = "AWS"
14:46:35.181 STDOUT terraform:             }
14:46:35.181 STDOUT terraform:         }
14:46:35.181 STDOUT terraform:     }
14:46:35.181 STDOUT terraform:   # aws_sns_topic_subscription.sqs_callback_subscription will be created
14:46:35.182 STDOUT terraform:   + resource "aws_sns_topic_subscription" "sqs_callback_subscription" {
14:46:35.182 STDOUT terraform:       + arn                             = (known after apply)
14:46:35.182 STDOUT terraform:       + confirmation_timeout_in_minutes = 1
14:46:35.182 STDOUT terraform:       + confirmation_was_authenticated  = (known after apply)
14:46:35.182 STDOUT terraform:       + endpoint                        = (known after apply)
14:46:35.182 STDOUT terraform:       + endpoint_auto_confirms          = false
14:46:35.182 STDOUT terraform:       + filter_policy_scope             = (known after apply)
14:46:35.182 STDOUT terraform:       + id                              = (known after apply)
14:46:35.182 STDOUT terraform:       + owner_id                        = (known after apply)
14:46:35.182 STDOUT terraform:       + pending_confirmation            = (known after apply)
14:46:35.182 STDOUT terraform:       + protocol                        = "sqs"
14:46:35.182 STDOUT terraform:       + raw_message_delivery            = true
14:46:35.182 STDOUT terraform:       + topic_arn                       = "arn:aws:sns:ca-central-1:296255494825:ses-callback"
14:46:35.182 STDOUT terraform:     }
14:46:35.182 STDOUT terraform:   # aws_sqs_queue.ses_receipt_callback_buffer will be created
14:46:35.182 STDOUT terraform:   + resource "aws_sqs_queue" "ses_receipt_callback_buffer" {
14:46:35.182 STDOUT terraform:       + arn                               = (known after apply)
14:46:35.182 STDOUT terraform:       + content_based_deduplication       = false
14:46:35.182 STDOUT terraform:       + deduplication_scope               = (known after apply)
14:46:35.182 STDOUT terraform:       + delay_seconds                     = 0
14:46:35.182 STDOUT terraform:       + fifo_queue                        = false
14:46:35.182 STDOUT terraform:       + fifo_throughput_limit             = (known after apply)
14:46:35.182 STDOUT terraform:       + id                                = (known after apply)
14:46:35.183 STDOUT terraform:       + kms_data_key_reuse_period_seconds = 0
14:46:35.183 STDOUT terraform:       + max_message_size                  = 262144
14:46:35.183 STDOUT terraform:       + message_retention_seconds         = 345600
14:46:35.183 STDOUT terraform:       + name                              = "ses-receipt-callback-buffer"
14:46:35.183 STDOUT terraform:       + name_prefix                       = (known after apply)
14:46:35.183 STDOUT terraform:       + policy                            = (known after apply)
14:46:35.183 STDOUT terraform:       + receive_wait_time_seconds         = 0
14:46:35.183 STDOUT terraform:       + redrive_allow_policy              = (known after apply)
14:46:35.183 STDOUT terraform:       + redrive_policy                    = (known after apply)
14:46:35.183 STDOUT terraform:       + sqs_managed_sse_enabled           = true
14:46:35.183 STDOUT terraform:       + tags                              = {
14:46:35.183 STDOUT terraform:           + "Environment" = "production"
14:46:35.183 STDOUT terraform:         }
14:46:35.183 STDOUT terraform:       + tags_all                          = {
14:46:35.183 STDOUT terraform:           + "Environment" = "production"
14:46:35.183 STDOUT terraform:         }
14:46:35.183 STDOUT terraform:       + url                               = (known after apply)
14:46:35.183 STDOUT terraform:       + visibility_timeout_seconds        = 310
14:46:35.183 STDOUT terraform:     }
14:46:35.183 STDOUT terraform:   # aws_sqs_queue_policy.allow_sns_publish will be created
14:46:35.183 STDOUT terraform:   + resource "aws_sqs_queue_policy" "allow_sns_publish" {
14:46:35.183 STDOUT terraform:       + id        = (known after apply)
14:46:35.183 STDOUT terraform:       + policy    = (known after apply)
14:46:35.183 STDOUT terraform:       + queue_url = (known after apply)
14:46:35.183 STDOUT terraform:     }
14:46:35.183 STDOUT terraform: Plan: 3 to add, 0 to change, 0 to destroy.
14:46:35.183 STDOUT terraform: Changes to Outputs:
14:46:35.183 STDOUT terraform:   + ses_receipt_callback_buffer_arn                     = (known after apply)
14:46:35.192 STDOUT terraform: Warning: Argument is deprecated
14:46:35.192 STDOUT terraform:   with aws_s3_bucket.csv_bucket,
14:46:35.192 STDOUT terraform:   on s3.tf line 5, in resource "aws_s3_bucket" "csv_bucket":
14:46:35.192 STDOUT terraform:    5: resource "aws_s3_bucket" "csv_bucket" {
14:46:35.192 STDOUT terraform: server_side_encryption_configuration is deprecated. Use the
14:46:35.192 STDOUT terraform: aws_s3_bucket_server_side_encryption_configuration resource instead.
14:46:35.192 STDOUT terraform: (and 71 more similar warnings elsewhere)
14:46:35.192 STDOUT terraform: ─────────────────────────────────────────────────────────────────────────────
14:46:35.192 STDOUT terraform: Saved the plan to: plan.tfplan
14:46:35.192 STDOUT terraform: To perform exactly these actions, run the following command to apply:
14:46:35.192 STDOUT terraform:     terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_athena_workgroup.ad_hoc"]
WARN - plan.json - main - Missing Common Tags: ["aws_athena_workgroup.build_tables"]
WARN - plan.json - main - Missing Common Tags: ["aws_athena_workgroup.primary"]
WARN - plan.json - main - Missing Common Tags: ["aws_athena_workgroup.support"]
WARN - plan.json - main - Missing Common Tags: ["aws_budgets_budget.cloudwatch_data_scanned"]
WARN - plan.json - main - Missing Common Tags: ["aws_budgets_budget.notify_global"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.aws_health[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.route53_resolver_query_log[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries_failures[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries_failures_us_west_2[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries_us_west_2[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-bulk-not-being-processed-critical[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-bulk-not-being-processed-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-inflights-not-being-processed-critical[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-inflights-not-being-processed-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-not-being-processed-critical[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-not-being-processed-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.contact-3-500-error-15-minutes-critical[0]"]
WARN - plan.json - main - Missing Common...
```

</details>
